数据分析与R语言003 如何获取R帮助

[toc]
# 如何获取R帮助
今天我们给大家亮出江湖终极生存指南：自学的途径，告诉大家如何自我拓展，让你给点阳光就灿烂！

## 一、在RStudio中看Help

在R中求助，最直接的入口就是RStudio右下角的Help，如下图

RStudio 帮助页面示意图

大家还记得上期我们介绍如何看帮助页面吗？对，从描述(Description)、例子(Example)入手更直观容易理解。

与商业软件比一般开源免费的软件的帮助系统都比较单薄而且不是很规范，例子也较少。R语言的帮助系统也存在帮助页面的例子较少的问题。给大家推荐两个可能可以看到更多例子的方法：

1使用demo函数
如果你想看某个函数的使用样例，可以尝试使用demo函数，它里面也包含一些你想要的函数示范小案例，你可以输入demo()查看已经加载进内存的包里有例子的函数列表，输入demo(“function_name”)就可以执行某个具体函数的例子啦！

2参考Quick-R网站
如果你想看某些统计方法及数据操作的样例，网站Quick-R 可助你一臂之力。（ http://www.statmethods.net/index.html）里面的内容很丰富，包含了大量按主题划分的包含完整代码的示范，极易上手。另外，它每一篇文章里包含了很多相关主题的超链接，让你在学习中间有不懂就直接跳到相关的解释页面。

Qucik-R 网站主页

## 二、求助于开源社区、论坛

第一期我们介绍过R语言是一个具有强大社区支持的软件，因此遇到困难时一定别忘了求助于这些社区，这一期我们就具体介绍一下三大社区网站: COS中文论坛、Stack Overflow和GitHub。

* COS中文论坛

这是统计之都旗下的论坛网站，它同其主站（www.cos.name）一起，是一个致力于推广与应用统计学知识的网站和社区。统计之都最初由谢益辉于2006年创办，现由世界各地的众多志愿者共同管理维护。下面是该论坛的首页，如果你有问题，可以先在此论坛查找与自己问题相关的帖子，看是否有人问过类似的问题；或者从讨论区中进入，按主题分类查找答案。

COS论坛主页

COS论坛讨论区

* Stack Overflow

Stack Overflow是一个专业的编程问答类网站，大家在上面提出各种技术难题，热心的专业人员就会尝试解答，其他的观众呢可以通过点赞把优秀的回答升到前面，这就让我们在查询时可以快速看到优质解答，很是方便哟。下面就是它的主页，大家遇到问题时，直接把问题的相关关键字输入搜索框就可以啦！

Stack Overflow主页

	* GitHub

关注前几期的童鞋会发现，这个网站在前几期就已经频频露面了，上期我们还具体介绍过如何从这个网站上下载最新的包，错过的同学可再回顾一下。

简单的说，GitHub是一个网上的代码托管工具。在这里，大家共享项目代码，并且可以互相批注，修改以及合并等。你可以学习别人做项目的完整代码；（想想这对于快速开发自己的项目产品多有用！）还可以把你自己的项目代码放上去，让全世界的人帮你修改和完善。

那么这个网站能在哪些方面帮助我们呢？根据上面的介绍，此地最富有的是各类项目、方法的程序示例，那么如果我们想开发一个项目或者想使用某种方法实现功能却又不知道从何入手时，就可以在这里搜索，看相关demo，获取灵感。

比如前几天你听完狗熊会政委在直播间的直播《逆天的数据探索性分析你值得拥有》之后，想了解一下在这个领域有没有可供自己直接玩耍的现成代码块，你就可以在GitHub中输入“R Exploratory Data Analysis“，然后点击回车即可看到以下显示。

GitHub 搜索结果页面

大家可以看到搜索结果包括一些R包说明，点开第一个链接，仔细阅读README 文档，就可以拿到你想要的那些代码块啦！

GitHub 详细代码

GitHub可视化结果

## 三、学会使用搜索引擎google或bing

当然，上述社区只是R语言用户经常出没和活跃的地方，如果想搜到更多更广泛的资料，万能的谷歌就是我们的不二之选！它的搜索能力强大，定位精准，不仅可以完美捕捉R社区里的相关解答，还会搜寻出其他各类形式，各种来源的辅助学习材料，让我们有机会深入了解问题的来龙去脉，而不仅仅是获得一个答案。下面以两个最常见的情景为例，来看看遇到疑难杂症时如何“放狗搜”。

1当你遭遇八哥（bug）时：

背景：read.csv 是一个可以用来读入csv格式数据的函数，它的基本用法是read.csv(file, header = TRUE)，其中参数file用来输入要读入的文件名，header用来告诉电脑是否把读入文件的第一行识别为标题，而不是数据。

问题：有天，想读入一张存有“全国各省份与东西部地区对应数据”的表格，于是开心的使用上read.csv准备大展身手，然而突然蹦出了这样的错误！

啥啥啥，这说的都是啥，心中顿时懵圈了，赶紧上谷歌看看这个问题到底咋回事。首先，把这个错误提示简单粗暴地粘在搜索框内，前面加一个R，很多时候，这样就会出来还不错的搜索结果：

谷歌搜索示意图1

果不其然，我们光看前几条返回结果，就可以知道出现错误的原因大概与中英文的编码有关。事实上，如果点开第一条链接，里面就有中英文编码的知识以及类似问题的解决办法，那就是：改变整个文件的编码格式，即在read.csv函数中，将参数fileEncoding设置为能够读取汉语的编码方式，比如“GBK”就行啦，再一试，完美解决！

当然，如果你提取出该错误信息的英文关键词，也可以同样搜索到相关答案，如下示意图：

谷歌搜索示意图2

大家可以看到：在我们的搜索结果中，排名靠前的网站往往都是前面介绍过的R社区，但又不局限于这些，我们可以一一翻看来了解问题的全貌。
友情提示
另外，在这里附一则搜索小技巧：在使用搜索引擎时能用英文查询就尽量用英文查，毕竟很多领域，英文资料远比中文的要丰富得多。这里再用前面“探索性数据分析”的例子让大家简单感受一下中英文搜索的区别，分别输入“探索性数据分析”和“Exploratory Data Analysis” 会得到以下的搜索结果：

中文搜索结果示意图

英文搜索结果示意图

细心的童鞋们可能已经看出来了：从数量上比，中文大概返回200多万条记录，而英文则返回了1200多万条记录，再从质量上看，中文返回结果的前几页大多都是零散的对相关主题介绍性文章，甚至是书籍链接，做了解用可以，但想深入学习恐怕就力不从心，而英文返回的资料则丰富得多，有很多课程链接，甚至前几个网页上点进去都是可以系统学习这个主题的ebook，比如第二个链接的页面就是这样：

ebook示意图

怎么样？有理论有案例，有技术有工具，是不是瞬间感觉有如神助呀！所以用好搜索引擎，你就是把一个最高级的助手放在了身边！

2当你想要寻找新功能时

除了遇到bug时可以求助谷歌，当你想要寻找新功能，实现新方法却不知从何下手时，它也是一个绝好的帮手喔。举例来说，如果你手头有一个含大量数据的csv，你嫌普通的read.csv函数太慢影响效率？直接问问谷歌看能否有办法提高读入数据的速度：

谷歌搜索示意图3

看，排名靠前的搜索结果均来自于R-bloggers, Stack Overflow, CRAN官网这类较权威的地方，提供了很多提高效率的法子。我们不妨打开其中的Stack Overflow网站一探究竟。可以看到，“热心网友”已经给出了全面专业的解答，不仅有R包，还有对应函数。感兴趣的朋友可以一一尝试，看看读入大型csv文件时是不是速度快的飞起了？针对如何高效读入大型文件之后还有更加详细的解读和总结，敬请期待！

Stack Overflow解答

## 四、山穷水尽找不到答案？那就在社区中提问吧~

如果我们实在找不到问题的答案，那就在论坛中贴出来，向高手们求助吧。读到这里很多同学是不是会说：提问求助谁不会呀？我可以碰到问题首先就抛在网上，坐等回答，干嘛还要前面那么费劲地到处搜来搜去呢？

如果你这样想，很可能你已经加入网络上有名的一群人：伸手党，这群人常常遇到的困境是：发帖无数，收获甚少，甚至，即使有人回答答案也跟你的问题一样笼统，没有多少指导意义。

这个时候就不要埋怨这个世界上高手都傲慢啦~~同样都要交网费，高手凭啥有义务帮你回答呀？当然，这是玩笑话，但更大的事实是：很多高手并不傲慢，只是对那些懒于动脑的人才傲慢。所以你要先自己做好充足的搜索功课，既尊重了别人的时间，又会让你在搜索过程中不断明确自己的问题细节，自学能力蹭蹭蹭得涨。

当然关于如何提问也有很多技巧。Stack Overflow上有专门教大家如何更好求助的小技巧: http://stackoverflow.com/questions/ask/advice不过这个介绍比较笼统，再奉上一枚“偷艺神器”:《How To Ask Questions The Smart Way》专门就细讲在网络时代，如何聪明地求助才能让高手愿意回答你。秘籍可带回山洞里细读，只能帮你到这里了！

好啦，截止到现在，我们R语言入门介绍的部分就告一段落了，下一期，我们会开讲R中的数据类型，八一八关于数据类型，你不知道的那些事儿！欢迎大家继续关注哟~

## 作业
请根据以上方法，探索如何用R导入spss的数据文件，将其保存在一个变量中。用文字描述探索过程并给出程序代码。

> Written with [StackEdit](https://stackedit.io/).